---
type: ReleaseConditions
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 10
tags: [revit-api, class]
---

# ReleaseConditions

`Autodesk.Revit.DB.Structure.ReleaseConditions` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ReleaseConditions | — | `` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | Fx | 2023 | `public bool Fx { get ; set ; }` |
| Property | Fy | 2023 | `public bool Fy { get ; set ; }` |
| Property | Fz | 2023 | `public bool Fz { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Mx | 2023 | `public bool Mx { get ; set ; }` |
| Property | My | 2023 | `public bool My { get ; set ; }` |
| Property | Mz | 2023 | `public bool Mz { get ; set ; }` |
| Property | Start | 2023 | `public bool Start { get ; set ; }` |